Repository: enesakbal/flutter_l10n_example
Catalog: lib/l10n/arb/app_*.arb
Languages: de, tr

# homeAppBarTitle
source: Internationalization
de: Internationalisierung
tr: Uluslararasılaşma

# simpleTextTitle
source: Simple Text
de: Einfacher Text
tr: Basit Metin

# simpleTextContent
source: Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum
de: Lorem Ipsum ist ein einfacher Demo-Text für die Print- und Schriftindustrie. Lorem Ipsum ist in der Industrie bereits der Standard Demo-Text seit 1500, als ein unbekannter Schriftsteller eine Hand voll Wörter nahm und diese durcheinander warf um ein Musterbuch zu erstellen. Es hat nicht nur 5 Jahrhunderte überlebt, sondern auch in Spruch in die elektronische Schriftbearbeitung geschafft (bemerke, nahezu unverändert). Bekannt wurde es 1960, mit dem erscheinen von Letraset, welches Passagen von Lorem Ipsum enhielt, so wie Desktop Software wie Aldus PageMaker - ebenfalls mit Lorem Ipsum.
tr: Lorem Ipsum, dizgi ve baskı endüstrisinde kullanılan mıgır metinlerdir. Lorem Ipsum, adı bilinmeyen bir matbaacının bir hurufat numune kitabı oluşturmak üzere bir yazı galerisini alarak karıştırdığı 1500'lerden beri endüstri standardı sahte metinler olarak kullanılmıştır. Beşyüz yıl boyunca varlığını sürdürmekle kalmamış, aynı zamanda pek değişmeden elektronik dizgiye de sıçramıştır. 1960'larda Lorem Ipsum pasajları da içeren Letraset yapraklarının yayınlanması ile ve yakın zamanda Aldus PageMaker gibi Lorem Ipsum sürümleri içeren masaüstü yayıncılık yazılımları ile popüler olmuştur.

# calendarDatePickerTitle
source: Calendar Date Picker
de: Kalenderdatumsauswahl
tr: Takvim Tarih Seçici

# calendarDatePickerButton
source: Pick Date
de: Wählen Sie Datum
tr: Tarih Seç

# calendarDatePickerNoSelected
source: No date selected
de: Kein Datum ausgewählt
tr: Tarih seçilmedi

# basicPlaceholderTitle
source: Basic Placeholder Text
de: Einfacher Platzhaltertext
tr: Basit Yer Tutucu Metni

# basicPlaceholderContent
source: Hello, my name is {name}. I am {age} years old with {experience} years of experience with Flutter. Born on {birthDate} in {birthPlace}
de: Hallo {name}, Sie sind {age} Jahre alt und haben {experience} Jahre Erfahrung. Sie wurden am {birthDate} in {birthPlace} geboren.
tr: Merhaba, Ben {name}. {age} yaşındayım, {experience} yıldır Flutter geliştiriyorum. {birthDate} tarihli {birthPlace} doğumluyum

# nKangaroosTitle
source: Plural Text
tr: Çoğul Metin

# nKangaroosContent
source: {count, plural, =0{no kangaroos} =1{1 kangaroo} other{{count} kangaroos}}
de: {count, plural, =0{keine Kängurus} =1{1 Känguru} other{{count} Kängurus}}
tr: {count, plural, =0{kanguru yok} =1{bir kanguru} other{{count} kanguru}}

# pronounTitle
source: Select Text
de: Wählen Sie Geschlechtstext aus
tr: Cinsiyet Seçimi

# pronounContent
source: {gender, select, male{he} female{she} other{they}}
de: {gender, select, male{er} female{sie} other{sie}}
tr: {gender, select, male{o} female{o} other{onlar}}

# numberAndCurrenciesTitle
source: Number and Currencies
de: Anzahl und Währungen
tr: Sayı ve Para Birimleri

# simpleCurrencyContent
source: The price of the product is {currency1}
de: Der Preis des Produkts beträgt {currency1}
tr: Bu ürünün fiyatı {currency1}

# compactLongContent
source: The population of {country} is {compactLong}
de: Die Bevölkerung der {country} beträgt {compactLong}
tr: {country} ülkesinde {compactLong} insan yaşar
